app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book = @book.new(book_params)
     @book.user_id = current_user.id
     if @book.save
---
INSERT INTO "books" ("created_at", "updated_at", "body", "title", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2022-04-20 15:08:14.693416"], ["updated_at", "2022-04-20 15:08:14.693416"], ["body", "bbb"], ["title", "aaa"], ["user_id", 6]]

  def destroy
          @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]