app/controllers/users_controller.rb

  def show
    @users = User.all
    @user =  User.find(params[:id])
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
       @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aab"], ["updated_at", "2022-04-21 11:28:30.926702"], ["id", 6]]